package ru.java.courses;


public class Lesson5to8_OOP {

/*
    В этом задании необходимо реализовать объектную модель футбольной команды.
    Должны быть реализованы следующие требования:

    881. Модель должна содержать команду, включающую в себя тренера и игроков.
    882. Игроки могут как попадать в команду, так и удаляться из нее.
    388. Игроки бывают активные и запасные. Активные могут забивать голы, запасные - нет.
    Для каждого игрока свой счетчик голов.
    884. Игроков в команде может быть не больше 20.
    885. Игрок может быть либо вратарем, либо нападающим, либо защитником.
    886. В команде может быть только один тренер.
    887. У тренера есть опыть работы в годах.
    888. У каждого человека и у каждой команды всегда должно быть имя.
    889. У каждого игрока обязательно должна быть определена роль. (поле role, enum?)
    8810.Должна быть возможность получить количество голов забитых всеми игроками в команде.
    8811.Должна быть возможность получения количества игроков в команде.


    Некоторые названия классов полей и методов:

    Класс: FootballTeam
    Поля: players, name, coach
    Методы: addPlayers, getPlayersCount, getScore

    Класс: ScoringPlayer
    Поля: name, goals, role
    Методы: score

    Класс: PlayerRole

    Класс: Coach
    Поля: experience, name


    Модель создавайте в пакете ru.java.courses.sport.team.football. Импорты в тесте уже добавлены.


    Подсказки:
    1. Завершить выполнение с ошибкой можно так:
    throw new IllegalArgumentException("[Сообщение]");

    2. Не забывайте про геттеры и сеттеры
    3. Вспомните все чему я вас учил ©
*/

}
